In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\intel\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\intel\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\intel\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\intel\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\intel\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\intel\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [2]:
import pandas as pd

In [3]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City':['New York','Los Angeles','Chicago']
}

In [4]:
df = pd.DataFrame(data)

In [5]:
df

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [6]:
df.head()

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [7]:
df.tail()

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago

In [8]:
print(df.Age)

0    25
1    30
2    35
Name: Age, dtype: int64

In [9]:
df['Age']

0    25
1    30
2    35
Name: Age, dtype: int64

In [11]:
name_age_column = df[['Name','Age']]

In [12]:
name_age_column

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35

In [15]:
df[df['Age']>30]

      Name  Age     City
2  Charlie   35  Chicago

# Handle missing Data

In [36]:
df['Salary'] = [50000,None,60000]

In [37]:
df

      Name  Age         City   Salary
0    Alice   25     New York  50000.0
1      Bob   30  Los Angeles      NaN
2  Charlie   35      Chicago  60000.0

In [33]:
salary_median = df['Salary'].median()

In [38]:
salary_median

np.float64(55000.0)

In [42]:
df['Salary'].fillna(salary_median,inplace=True)

C:\Users\INTEL\AppData\Local\Temp\ipykernel_10264\3743029253.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df['Salary'].fillna(salary_median,inplace=True)

In [43]:
df['Salary']

0    55000.0
1    55000.0
2    55000.0
Name: Salary, dtype: float64

In [44]:
df

      Name  Age         City   Salary
0    Alice   25     New York  55000.0
1      Bob   30  Los Angeles  55000.0
2  Charlie   35      Chicago  55000.0

# Sort DataFrame

In [46]:
df.sort_values(by='City')

      Name  Age         City   Salary
2  Charlie   35      Chicago  55000.0
1      Bob   30  Los Angeles  55000.0
0    Alice   25     New York  55000.0

In [47]:
df.groupby('City').agg({'Age':'mean','Salary':'sum'})

              Age   Salary
City
Chicago      35.0  55000.0
Los Angeles  30.0  55000.0
New York     25.0  55000.0

# Apply custom Function

In [48]:
def age_group(age):
    if age<30:
        return 'Young'
    else:
        return 'Old'

In [49]:
df['Age'].apply(age_group)

0    Young
1      Old
2      Old
Name: Age, dtype: object